import kotlin.test.Test
/*
todo розпарсити вхідний текст на речення для перекладу, видалити зайві пробіли, табуляції, нові рядки, дубльовані рядки.
Приклад вхідного тексту: у файлі /src/test/resources/input.txt
Можуть бути кілька речень в одиниці перекладу, може бути кілька великих літер в одній одиниці, може бути зірочка а може не бути.
Ознака закінчення одиниці тексту - наявність знака пунктуації: крапка, знак питання або знак оклику. Може також супроводжуватися лапками.
Якщо закінчується лапками то і починається лапками, у цьому випадку зовнішні лапки не повинні відправлятись на переклад і потрапляти у вихідний файл.
*/
/*todo коли загальна довжина тексту, готового до перекладу, перевищує залишок безкоштовних символів:
   - показати підмножину повних рядків, які найбільш точно відповідають ліміту
   - показати користувачеві пронумеровані вибрані рядки та решту рядків з їхніми номерами та довжинами, а також ліміт
   - якщо користувач погоджується (введено "ок") - перекласти вибрані рядки
   - якщо користувач вводить масив чисел - перевірити, чи можливо це, і перекласти вибрані рядки, інакше показати повідомлення про помилку та запитати знову
 */
//todo коли переклад готовий - показати користувачеві пронумеровані пари: перекладений рядок - оригінальний рядок
//todo поки користувач вводить номер рядка - запитати новий переклад і замінити старий
//todo якщо вихідний файл не порожній - показати користувачеві його вміст, дату модифікації та запитати, чи хоче він його перезаписати, якщо ні то доповнити
/*todo коли користувач погоджується - записати переклад у вихідний csv (тільки замість коми використовуємо pipe).
   перекладений рядок1|original line1
   перекладений рядок2|original line2

   Приклад вихідного файлу: у файлі /src/test/resources/output.csv
 */
//todo якщо всі рядки були перекладені - очистити вхідний файл, показати повідомлення та вийти
//todo якщо деякі рядки не були перекладені - залишити їх у вхідному файлі, показати повідомлення та вийти

class TranslatorTest {

    @Test
    fun `your first test`() {

    }
}